Some notes which I had taken down for pandas.

In [1]:
import pandas as pd

Searching and replacing a pattern in a column in a pandas dataframe

In [13]:
d = {
    'id': [100, 200], 
    'details': ['{"name" => "abc", "age" => 23}', '{"name" => "def", "age" => 24}']
    }
df = pd.DataFrame(d)
df

    id                         details
0  100  {"name" => "abc", "age" => 23}
1  200  {"name" => "def", "age" => 24}

Now let's replace the '=>' in the second column to convert the data into json format

In [14]:
df['details'] = df['details'].str.replace('=>', ':')
df

    id                       details
0  100  {"name" : "abc", "age" : 23}
1  200  {"name" : "def", "age" : 24}

Lets add another column into the dataframe

In [26]:
sports = ['Football|Cricket', 'Football|Hockey|Chess|Badminton']
df['sports'] = sports
df

    id                       details                           sports
0  100  {"name" : "abc", "age" : 23}                 Football|Cricket
1  200  {"name" : "def", "age" : 24}  Football|Hockey|Chess|Badminton

Now to convert the 'sports' column into a json array split by '|', we have apply the following logic of converting a list to a json array on the whole column-

In [27]:
import json

In [28]:
x = [str(i) for i in range(10)]
x

['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']

In [29]:
json.dumps(x)

'["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]'

Now let's apply this to the whole column.

In [30]:
df['sports'] = df['sports'].str.split('|').apply(lambda x: json.dumps(x))
df

,id,details,sports
0,100,"{""name"" : ""abc"", ""age"" : 23}","[""Football"", ""Cricket""]"
1,200,"{""name"" : ""def"", ""age"" : 24}","[""Football"", ""Hockey"", ""Chess"", ""Badminton""]"